import React, {useCallback, useState} from 'react';
import ModalWindow from '../ModalWindow';

import styles from './RulesButton.module.scss';

type Props = {
	inGame: boolean
}

const RulesButton: React.FC<Props> = ({ inGame }) => {
	const [showModal, setShowModal] = useState(false);
	const closeModalHandler = useCallback(() => {
		setShowModal(false);
	}, []);
	const openModalHandler = useCallback(() => {
		setShowModal(true);
	}, []);
	return(<>
		<button className={inGame ? styles.buttonInGame : styles.button} disabled={showModal} onClick={openModalHandler}>Правила</button>
		{showModal && <ModalWindow closeHandler={closeModalHandler}>
			<Rules/>
		</ModalWindow>}
	</>);
};

export default RulesButton;

const Rules: React.FC = () => {
	return(<div className={styles.layout}>
		<p className={styles.title}>Цель игры</p>
		<p className={styles.text}>
			Все игроки - шпионы.
			Ваша задача - ловить других шпионов.
			Поймав определённое количество шпионов игрок побеждает.
		</p>
		<p className={styles.title}>Участник комнаты</p>
		<p className={styles.text}>
			Участник комнаты может стать зрителем или игроком перед началом матча, просматривать настройки комнаты и перечень используемых карт, а также менять свой ник.
		</p>
		<p className={styles.title}>Владелец комнаты</p>
		<p className={styles.text}>
			Владелец комнаты может начинать матч и ставить его на паузу.
			Также, он может изменять настройки комнаты и перечень используемых карт.
			Чтобы владелец смог начать матч, в комнате должно быть достаточно игроков для начала.
		</p>
		<p className={styles.title}>Игровое поле</p>
		<p className={styles.text}>
			Поле состоит из карт.
			Каждый игрок является одной из карт на игровом поле.
			Размер игрового поля регулируется владельцем комнаты.
			Поле случайно формируется из перечня карт в комнате.
			Если карт для покрытия поля не хватит, игра начнётся с перевёрнутыми картами для заполнения пустых позиций.
		</p>
		<p className={styles.title}>Действия</p>
		<p className={styles.text}>
			Все игроки ходят по очереди.
			Очередь формируется случайно в начале игры.
			Игрок во время своего хода может совершить одно их трёх действий: сдвинуть, допросить или поймать.
		</p>
		<p className={styles.text}>
			На ход даётся ограниченное количество времени, определяемое владельцем комнаты.
			Если игрок не успеет сделать ход, то автоматически произойдёт сдвиг.
			Все действия игроков записываются в логи.
		</p>
		<p className={styles.title}>Сдвинуть</p>
		<p className={styles.text}>
			Игрок может сдвинуть любой ряд влево или вправо или любую колонку вверх или вниз на одну позицию.
			Карта которая при этом выходит за рамки игрового поля перемещаяется на другой конец строки или столбца.
			Это можно использовать, чтобы запутать других игроков или подобраться к ним ближе.
		</p>
		<p className={styles.title}>Допросить</p>
		<p className={styles.text}>
			Игрок может допросить любую соседнюю от себя карту.
			Допрошенная карта скажет, если ли вокруг неё других шпионы, помимо спросившего игрока.
			Это можно использовать, чтобы сократить круг подозреваемых.
		</p>
		<p className={styles.title}>Поймать</p>
		<p className={styles.text}>
			Игрок может поймать любую соседнюю от себя карту.
			Если карта окажется шпионом, то поймавший игрок получает балл, а пойманный станет одной из других карт.
			Если игрок, указав на карту, не поймает игрока, то он пропускает ход.
			Игрок может попытаться поймать себя, в глазах других игроков это будет выглядеть так, как будто он ошибся с предположением.
			Это можно использовать, чтобы сократить круг подозреваемых или набирать баллы для победы.
		</p>
	</div>);
};